
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	СоздатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсе(Команда)
	УдалитьВсеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьНаСервере()
	СоздатьЭлементыРекурсивно();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВсеНаСервере()
	Выборка = Справочники.СправочникТест.ВыбратьИерархически(,,,"Код убыв");
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.ПолучитьОбъект();
		СправочникОбъект.Удалить();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыРекурсивно(Родитель = Неопределено, УровеньВложенности = 0)
	
	Если УровеньВложенности > Объект.УровеньВложенности Тогда
		Возврат;
	КонецЕсли;
		
	УровеньВложенности = УровеньВложенности + 1;

	Для Номер = 1 По Объект.КоличествоПапок Цикл
		НовыйЭлемент = Справочники.СправочникТест.СоздатьГруппу();
		НовыйЭлемент.Наименование = "Группа " + Номер;
		НовыйЭлемент.Родитель = Родитель;
		НовыйЭлемент.Записать();
		СоздатьЭлементыРекурсивно(НовыйЭлемент.Ссылка, УровеньВложенности);
	КонецЦикла;
	
	Для Номер = 1 По Объект.КоличествоЭлементов Цикл
		НовыйЭлемент = Справочники.СправочникТест.СоздатьЭлемент();
		НовыйЭлемент.Наименование = "Элемент " + Номер;
		НовыйЭлемент.Родитель = Родитель;
		НовыйЭлемент.Записать();
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти