
#Область ОбработчикиСобытийФормы

//@skip-check org.eclipse.xtext.diagnostics.Diagnostic.Syntax
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.КоличествоПапок = 3;
	Объект.КоличествоЭлементов = 2;
	Объект.УровеньВложенности = 3;
	
	ТестовоеСообщение = "Тестовое сообщение";
	
	// Рандомный шлак
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Номенклатура", "Унитаз");
	ПараметрыЗаполнения.Вставить("Цена", 200);
	ПараметрыЗаполнения.Вставить("Количество", 2);
	ПараметрыЗаполнения.Вставить("Сумма", 400);

	//
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	СоздатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсе(Команда)
	УдалитьВсеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьНаСервере()
	СоздатьЭлементыРекурсивно();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВсеНаСервере()
	Выборка = Справочники.СправочникТест.ВыбратьИерархически(,,,"Код убыв");
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.ПолучитьОбъект();
		СправочникОбъект.Удалить();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыРекурсивно(Родитель = Неопределено, УровеньВложенности = 0)
	
	Если УровеньВложенности > Объект.УровеньВложенности Тогда
		Возврат;
	КонецЕсли;
		
	УровеньВложенности = УровеньВложенности + 1;

	// Доработка хрюнделей/поросят

	Для Номер = 1 По Объект.КоличествоПапок Цикл
		НовыйЭлемент = Справочники.СправочникТест.СоздатьГруппу();
		НовыйЭлемент.Наименование = "Хрюндель " + Номер;
		НовыйЭлемент.Родитель = Родитель;
		НовыйЭлемент.Записать();
		СоздатьЭлементыРекурсивно(НовыйЭлемент.Ссылка, УровеньВложенности);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Хрюк!";
		Сообщение.Сообщить();
	КонецЦикла;
	
	Для Номер = 1 По Объект.КоличествоЭлементов Цикл
		НовыйЭлемент = Справочники.СправочникТест.СоздатьЭлемент();
		НовыйЭлемент.Наименование = "Поросенок " + Номер;
		НовыйЭлемент.Родитель = Родитель;
		НовыйЭлемент.Записать();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Хрю!";
		Сообщение.Сообщить();
	КонецЦикла;

	// Тестирование работы с репо
	
	//невероятно необходимая фича
	
	// Поправил ошибку, на 0 делить нельзя!
	//x = 1/0;
	
КонецПроцедуры


#КонецОбласти


